---
kind: enumMember
id: F:Autodesk.Revit.DB.Structure.BendingDetailSegmentsRepresentation.Offset
enum: Autodesk.Revit.DB.Structure.BendingDetailSegmentsRepresentation
zh: 偏移、偏移量
source: html/bb27708f-110c-f59b-3056-b8c45eabe5f6.htm
---
# Autodesk.Revit.DB.Structure.BendingDetailSegmentsRepresentation.Offset

**中文**: 偏移、偏移量

Some of the bar segments will be lengthened so there is no intersection between them.